{
  "backend/main.mo": "Defines actor with types and CRUD state maps for jobs, candidates, interviews, clients, and user profiles, including access control and profile APIs.",
  "feature_evidence.json": "Feature evidence report listing optional-select sentinel changes and related frontend files for two features.",
  "frontend-file-summaries.txt": "JSON-like document summarizing various frontend files for routing, forms, utilities, and styling.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry template loading the React app with favicon and root container.",
  "frontend/src/App.tsx": "Main router setup configuring authentication gates, profile checks, and route definitions for all pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple UI screen showing an access denied message with navigation back to dashboard.",
  "frontend/src/components/AppHeader.tsx": "Header displaying branding, user profile menu, role info, and logout handling.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper with header, sidebar, main content region, and footer.",
  "frontend/src/components/AppSidebar.tsx": "Sidebar navigation listing main app sections with active state highlighting.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component enforcing authentication and loading states before rendering children.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state component with optional illustration, text, and action button.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A dialog component that collects name and email, then saves the user profile via a mutation.",
  "frontend/src/hooks/queryKeys.ts": "Defines structured React Query keys for user, jobs, candidates, interviews, and clients.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, loading, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, roles, admin status, jobs, candidates, interviews, and clients.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/candidates/CandidateCreatePage.tsx": "Form page for creating a new candidate, validating inputs and submitting to the createCandidate API before navigating to the detail page.",
  "frontend/src/pages/candidates/CandidateDetailPage.tsx": "Displays detailed candidate information, related job opening data, and status badges, with navigation to edit.",
  "frontend/src/pages/candidates/CandidateEditPage.tsx": "Loads an existing candidate into an editable form, validates updates, and submits changes to updateCandidate.",
  "frontend/src/pages/candidates/CandidatesListPage.tsx": "Lists all candidates with search, status filtering, and delete actions, providing navigation to create or view candidates.",
  "frontend/src/pages/clients/ClientCreatePage.tsx": "Form page for creating a new client with required fields validated before submitting to createClient.",
  "frontend/src/pages/clients/ClientDetailPage.tsx": "Displays detailed client information, including status, notes, and contact details, with navigation and edit actions.",
  "frontend/src/pages/clients/ClientEditPage.tsx": "Provides a form to edit an existing client's data with validation and submission to update the record.",
  "frontend/src/pages/clients/ClientsListPage.tsx": "Shows a searchable, filterable list of clients with options to view, edit, or delete entries.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing stats for jobs, candidates, interviews, and clients with navigation shortcuts.",
  "frontend/src/pages/interviews/InterviewCreatePage.tsx": "Form for scheduling a new interview, collecting candidate, job, date, time, type, and location data.",
  "frontend/src/pages/interviews/InterviewDetailPage.tsx": "Displays interview details with status, candidate/job info, outcome notes, and a link to edit the interview.",
  "frontend/src/pages/interviews/InterviewEditPage.tsx": "Form page for editing an interview, loading existing data, validating inputs, and submitting updates via mutation.",
  "frontend/src/pages/interviews/InterviewsListPage.tsx": "Lists all interviews with status filtering, candidate lookup, and deletion support through a confirmation dialog.",
  "frontend/src/pages/jobs/JobCreatePage.tsx": "Form page for creating a new job opening with client selection, validation, and submission to the API.",
  "frontend/src/pages/jobs/JobDetailPage.tsx": "Displays detailed information about a job opening, including client info, status badge, and navigation to edit.",
  "frontend/src/pages/jobs/JobEditPage.tsx": "Form page for editing an existing job opening, preloading data, validating fields, and submitting updates.",
  "frontend/src/pages/jobs/JobsListPage.tsx": "React page showing a searchable, filterable list of job openings with status badges and delete confirmation.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with a styled UI and loading state.",
  "frontend/src/utils/optionalSelect.ts": "Provides a sentinel value and mapping helpers to handle optional shadcn-ui Select fields.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout settings with plugins enabled.",
  "project_state.json": "Project state metadata describing features, issues, and requirements for the hospitality management app."
}