{
  "backend/main.mo": "Motoko backend defining types, maps, and CRUD-related state for jobs, candidates, clients, interviews, and user profiles with authorization checks.",
  "feature_evidence.json": "Feature evidence report listing UI crash fixes and backend data consistency checks along with related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend React components, pages, hooks, and utilities.",
  "frontend/index.css": "Empty CSS placeholder file.",
  "frontend/index.html": "HTML entry point configuring metadata, favicon, root div, and script loading the React app.",
  "frontend/src/App.tsx": "Main React router configuration and root component handling authentication, profile setup, and page routing.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component showing an access denied message with navigation back to the dashboard.",
  "frontend/src/components/AppHeader.tsx": "Header displaying branding, user profile info, role label, and logout menu.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper composing header, sidebar, content area, and footer.",
  "frontend/src/components/AppSidebar.tsx": "Sidebar navigation listing all main routes with active-state highlighting.",
  "frontend/src/components/AuthGate.tsx": "Gatekeeper component that blocks access until identity and profile are loaded, falling back to login or loader.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state display with optional illustration, icon, and action button.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A dialog component that collects name and email, then saves the user's profile using a mutation.",
  "frontend/src/hooks/queryKeys.ts": "Defines structured React Query keys for users, jobs, candidates, interviews, and clients.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor methods for fetching and mutating user profiles, jobs, candidates, interviews, and clients.",
  "frontend/src/index.css": "Tailwind CSS base configuration defining light/dark theme variables and global styles.",
  "frontend/src/main.tsx": "App entry that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/candidates/CandidateCreatePage.tsx": "Form page to create a new candidate, validate inputs, submit via mutation, and redirect to the detail page.",
  "frontend/src/pages/candidates/CandidateDetailPage.tsx": "Displays detailed candidate info with status, contact data, job link, and navigation to edit.",
  "frontend/src/pages/candidates/CandidateEditPage.tsx": "Loads an existing candidate, pre-fills a form for editing, validates input, updates via mutation, and redirects back to details.",
  "frontend/src/pages/candidates/CandidatesListPage.tsx": "Lists all candidates with search, status filter, actions to view/edit/delete, and a button to create new candidates.",
  "frontend/src/pages/clients/ClientCreatePage.tsx": "Form page for creating a new client with validation, staffing requirements handling, submission, and redirect to client detail.",
  "frontend/src/pages/clients/ClientDetailPage.tsx": "Displays full client details, status, contact info, and staffing requirements with navigation and job opening badges.",
  "frontend/src/pages/clients/ClientEditPage.tsx": "Provides a form to edit client information and staffing requirements, handling validation and update submission.",
  "frontend/src/pages/clients/ClientsListPage.tsx": "Shows a searchable and filterable client list with actions for viewing, editing, and deleting clients.",
  "frontend/src/pages/clients/components/StaffingRequirementsEditor.tsx": "Allows adding, editing, and removing staffing requirement strings in a form-friendly UI.",
  "frontend/src/pages/clients/components/StaffingRequirementsTable.tsx": "Displays staffing requirements in a simple list or an empty-state card when none exist.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard that aggregates stats for jobs, candidates, interviews, and clients, with navigation shortcuts.",
  "frontend/src/pages/interviews/InterviewCreatePage.tsx": "Form for scheduling a new interview, validating inputs and submitting interview creation.",
  "frontend/src/pages/interviews/InterviewDetailPage.tsx": "Shows detailed interview info including candidate, job, status, type, and notes with navigation to edit.",
  "frontend/src/pages/interviews/InterviewEditPage.tsx": "Loads an interview, populates a form for editing, validates inputs, and submits updates via mutation.",
  "frontend/src/pages/interviews/InterviewsListPage.tsx": "Displays a filterable list of interviews with status badges and supports deleting interviews.",
  "frontend/src/pages/jobs/JobCreatePage.tsx": "Provides a form to create a new job opening with validation and submission to the backend.",
  "frontend/src/pages/jobs/JobDetailPage.tsx": "Shows detailed information about a job opening, including client info and status, with a link to edit.",
  "frontend/src/pages/jobs/JobEditPage.tsx": "Loads an existing job opening into a form, allows editing fields, and submits updates.",
  "frontend/src/pages/jobs/JobsListPage.tsx": "React page listing job openings with search, status filters, navigation, and delete handling with confirmation.",
  "frontend/src/pages/LoginPage.tsx": "Login page allowing users to authenticate via Internet Identity with a styled UI.",
  "frontend/src/utils/candidateStatusPresentation.ts": "Maps candidate status values to presentation objects defining badge variant and label with safe fallbacks.",
  "frontend/src/utils/optionalSelect.ts": "Provides sentinel-based helpers for handling optional shadcn Select values without using empty-string items.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and enabling plugins like typography and container queries.",
  "project_state.json": "Stores project metadata including feature requirements, architectural notes, known issues, and version state."
}