{
  "backend/main.mo": "Defines data types and in-memory state for jobs, candidates, interviews, clients, and user profiles, with access control and basic profile/job APIs.",
  "feature_evidence.json": "Lists feature evidence items mapping implemented UI and components to feature requirements with metadata and file references.",
  "frontend-file-summaries.txt": "Provides brief descriptions of various frontend files, mainly React pages and global styling, used for build documentation.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry file that loads the React app and sets favicon and metadata.",
  "frontend/src/App.tsx": "Configures TanStack Router, authentication gating, route tree, and layout rendering for the entire React app.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple UI screen informing users they lack permissions, with navigation back to the dashboard.",
  "frontend/src/components/AppHeader.tsx": "Renders the top navigation bar with logo, user menu, role display, and logout handling.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with header, sidebar, main content area, and footer structure.",
  "frontend/src/components/AppSidebar.tsx": "Provides main navigation sidebar with route-aware highlighting and icon-based links.",
  "frontend/src/components/AuthGate.tsx": "Protects content by checking Internet Identity auth and profile loading before rendering children.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state component showing illustration, message, and optional action button.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A dialog component that collects name and email, then saves the user's profile via a mutation.",
  "frontend/src/hooks/queryKeys.ts": "Defines structured React Query keys for profiles, roles, jobs, candidates, interviews, and clients.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login state, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, roles, jobs, candidates, interviews, and clients via the backend actor.",
  "frontend/src/index.css": "Tailwind base setup with extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Application entry point configuring React Query and Internet Identity provider around the app.",
  "frontend/src/pages/candidates/CandidateCreatePage.tsx": "Form page for creating a new candidate, validating inputs and submitting via createCandidate API before redirecting to the detail view.",
  "frontend/src/pages/candidates/CandidateDetailPage.tsx": "Displays detailed candidate info including status, contact details, and related job opening, with navigation to edit.",
  "frontend/src/pages/candidates/CandidateEditPage.tsx": "Form page for editing an existing candidate, preloading data, validating inputs, and updating via updateCandidate API.",
  "frontend/src/pages/candidates/CandidatesListPage.tsx": "Lists all candidates with search, status filtering, and delete actions, linking to create and detail pages.",
  "frontend/src/pages/clients/ClientCreatePage.tsx": "Form page for creating a new client with validation and submission through createClient API, redirecting to the client detail page.",
  "frontend/src/pages/clients/ClientDetailPage.tsx": "Displays detailed client info with status, notes, contact details, and navigation to editing.",
  "frontend/src/pages/clients/ClientEditPage.tsx": "Provides a form to edit an existing client, handling validation and update submission.",
  "frontend/src/pages/clients/ClientsListPage.tsx": "Shows a searchable, filterable list of clients with actions to view, edit, or delete entries.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing counts of jobs, candidates, interviews, and clients with navigation shortcuts.",
  "frontend/src/pages/interviews/InterviewCreatePage.tsx": "Form for scheduling a new interview, validating inputs and creating an interview record.",
  "frontend/src/pages/interviews/InterviewDetailPage.tsx": "Displays interview details, including status, type, candidate info, and outcome notes.",
  "frontend/src/pages/interviews/InterviewEditPage.tsx": "Loads an interview, populates a form, validates input, and submits updates to the interview.",
  "frontend/src/pages/interviews/InterviewsListPage.tsx": "Displays all interviews with status filtering and supports navigation and deletion.",
  "frontend/src/pages/jobs/JobCreatePage.tsx": "Provides a form to create a new job opening, validating fields and submitting to the API.",
  "frontend/src/pages/jobs/JobDetailPage.tsx": "Shows detailed information about a job opening, including client info and status.",
  "frontend/src/pages/jobs/JobEditPage.tsx": "Loads an existing job, fills an editable form, validates changes, and submits updates.",
  "frontend/src/pages/jobs/JobsListPage.tsx": "React page that lists job openings with search, status filtering, navigation, and delete confirmation logic.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication with a styled UI layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata describing features, requirements, assets, and current state for the Tyagi Chef app."
}