{
  "kind": "build_request",
  "title": "Fix Shadcn SelectItem empty-string value errors for optional Select fields",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Remove all <SelectItem value=\"\">…</SelectItem> usages and replace them with a non-empty sentinel value (e.g., \"__none__\") for optional selects (Job Client, Candidate Linked Job, Interview Job Opening) while preserving the ability to clear the selection and show the placeholder by setting the Select value to an empty string.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "A <Select.Item /> must have a value prop that is not an empty string. This is because the Select value can be set to an empty string to clear the selection and show the placeholder."
        ]
      },
      "acceptanceCriteria": [
        "No <SelectItem> in the app uses an empty string value prop.",
        "Optional selects still provide a visible \"None\" option that clears the selection (internally sets Select value to \"\") so the placeholder is shown.",
        "The runtime warning/error about empty-string SelectItem values no longer appears in the browser console."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Update the optional-select implementations in these pages to use the sentinel \"None\" option and map it to clearing the selection (empty string) in component state: frontend/src/pages/candidates/CandidateCreatePage.tsx (jobOpeningId), frontend/src/pages/candidates/CandidateEditPage.tsx (jobOpeningId), frontend/src/pages/interviews/InterviewCreatePage.tsx (jobOpeningId), frontend/src/pages/interviews/InterviewEditPage.tsx (jobOpeningId), frontend/src/pages/jobs/JobCreatePage.tsx (clientId), frontend/src/pages/jobs/JobEditPage.tsx (clientId).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "A <Select.Item /> must have a value prop that is not an empty string."
        ]
      },
      "acceptanceCriteria": [
        "In each listed page, selecting \"None\" results in the relevant state field being set to \"\" (empty string).",
        "Submitting each form with \"None\" selected continues to send null for the corresponding optional backend field (e.g., jobOpeningId/clientId/jobOpeningId).",
        "Selecting a real entity value still sets the state field to that entity id string and submits correctly."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (these are read-only); fix usage at the page/component level instead."
  ],
  "nonGoals": [
    "Changing backend APIs or data models.",
    "Changing the Select component implementation in the shadcn/ui layer beyond usage changes in pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}