{
  "kind": "build_request",
  "title": "Restrict app access to Admin users only",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Restrict all backend APIs to Admin-only access so that only Admin users can view, create, update, or delete any Jobs, Candidates, Interviews, Clients, and UserProfile records.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ye app kewal admin hi use kar sake"
        ]
      },
      "acceptanceCriteria": [
        "Any call to Job Opening APIs (create/get/list/update/delete/getJobOpeningsForClient) traps unless the caller is an Admin.",
        "Any call to Candidate APIs (create/get/list/update/delete) traps unless the caller is an Admin.",
        "Any call to Interview APIs (create/get/list/update/delete) traps unless the caller is an Admin.",
        "Any call to Client APIs (create/get/list/update/delete/getClientWithJobOpenings) traps unless the caller is an Admin.",
        "Any call to user profile APIs (getCallerUserProfile/getUserProfile/saveCallerUserProfile) traps unless the caller is an Admin.",
        "Admin users can continue to use all APIs successfully."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add an Admin-only frontend gate: if a logged-in user is not an Admin (as determined by the backend), show an Access Denied screen instead of the main app layout/routes and allow the user to log out.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ye app kewal admin hi use kar sake"
        ]
      },
      "acceptanceCriteria": [
        "When a non-Admin user logs in, the app does not render the main navigation (AppLayout/sidebar) and instead shows an access denied view.",
        "The access denied view is user-facing English text (e.g., \"Access Denied\") and provides a clear way to log out.",
        "Admin users can access all existing routes (/dashboard, /jobs, /candidates, /interviews, /clients and their sub-routes) as before.",
        "If a non-Admin user attempts to navigate directly to a protected route URL, they still see the access denied view rather than the page content."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Ensure frontend query/mutation error handling remains stable under Admin-only backend authorization (e.g., unauthorized traps) without causing blank screens or runtime crashes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ye app kewal admin hi use kar sake"
        ]
      },
      "acceptanceCriteria": [
        "When the backend returns an authorization trap for any query/mutation while the user is non-Admin, the UI remains responsive and displays the access denied view rather than crashing.",
        "No infinite loading state occurs when a non-Admin user is logged in and blocked from access."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing a new authentication provider (only Internet Identity is used).",
    "Adding new roles beyond the existing role model; the change is to restrict usage to Admin only.",
    "Building a full admin management UI for promoting/demoting users (unless it already exists)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}